notify/sendsms/log.txt


FON7bjjE3jsJGhHUWj--254724802834--DeliveryImpossible--2019-01-28 02:24:37pm
<?xml version="1.0" encoding="utf-8" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><ns1:NotifySOAPHeader xmlns:ns1="http://www.huawei.com.cn/schema/common/v2_1"><ns1:spId>602078</ns1:spId><ns1:serviceId>6020782000004277</ns1:serviceId><ns1:traceUniqueID>504021503231901281524445122003</ns1:traceUniqueID></ns1:NotifySOAPHeader></soapenv:Header><soapenv:Body><ns2:notifySmsDeliveryReceipt xmlns:ns2="http://www.csapi.org/schema/parlayx/sms/notification/v2_2/local"><ns2:correlator>FON7bjjE3jsJGhHUWj</ns2:correlator><ns2:deliveryStatus><address>tel:254724802834</address><deliveryStatus>DeliveryImpossible</deliveryStatus></ns2:deliveryStatus></ns2:notifySmsDeliveryReceipt></soapenv:Body></soapenv:Envelope>
